xml-mgmt-RequestCustomize.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:man="http://www.datapower.com/schemas/management">
    <soapenv:Header/>
    <soapenv:Body>
        <man:request domain="kirby_domain">
            <!--<dp:get-samlart user="kirby" password=""/>-->
            <!--<man:get-file name="cert:///DATA-sscert.pem"/>-->
            <!--<man:set-file name="local:///cert-to-store.pem">cid:876659279198</man:set-file>-->
            <do-action>
                <FetchFile>
                    <URL>*</URL>
                    <File>local:///imagetest.jpg</File>
                </FetchFile>
                <Keygen>
                    <!--Optional:-->
                    <LDAPOrder>?</LDAPOrder>
                    <!--Optional:-->
                    <C>?</C>
                    <!--Optional:-->
                    <ST>?</ST>
                    <!--Optional:-->
                    <L>?</L>
                    <!--Optional:-->
                    <O>?</O>
                    <!--Optional:-->
                    <OU>?</OU>
                    <!--Optional:-->
                    <OU1>?</OU1>
                    <!--Optional:-->
                    <OU2>?</OU2>
                    <!--Optional:-->
                    <OU3>?</OU3>
                    <CN>?</CN>
                    <!--Optional:-->
                    <KeyLength>?</KeyLength>
                    <!--Optional:-->
                    <FileName>?</FileName>
                    <!--Optional:-->
                    <Days>?</Days>
                    <!--Optional:-->
                    <Password>?</Password>
                    <!--Optional:-->
                    <PasswordAlias>?</PasswordAlias>
                    <!--Optional:-->
                    <KwkExportable>?</KwkExportable>
                    <!--Optional:-->
                    <ExportKey>?</ExportKey>
                    <!--Optional:-->
                    <GenSSCert>?</GenSSCert>
                    <!--Optional:-->
                    <ExportSSCert>?</ExportSSCert>
                    <!--Optional:-->
                    <GenObject>?</GenObject>
                    <!--Optional:-->
                    <ObjectName>?</ObjectName>
                    <!--Optional:-->
                    <HSM>?</HSM>
                    <!--Optional:-->
                    <UsingKey>?</UsingKey>
                </Keygen>
                <CryptoImport>
                    <!--Optional:-->
                    <ObjectType>?</ObjectType>
                    <ObjectName>?</ObjectName>
                    <InputFilename>?</InputFilename>
                    <!--Optional:-->
                    <ImportPassword>?</ImportPassword>
                    <!--Optional:-->
                    <ImportPasswordAlias>?</ImportPasswordAlias>
                    <!--Optional:-->
                    <KwkExportable>?</KwkExportable>
                </CryptoImport>
                <CryptoExport>
                    <!--Optional:-->
                    <ObjectType>?</ObjectType>
                    <ObjectName>?</ObjectName>
                    <OutputFilename>?</OutputFilename>
                    <!--Optional:-->
                    <Mechanism>?</Mechanism>
                </CryptoExport>
            </do-action>
            <man:get-config>
                <CryptoKey name="?" local="?" intrinsic="?" read-only="?" external="?">
                    <!--Optional:-->
                    <mAdminState>?</mAdminState>
                    <!--You have a CHOICE of the next 3 items at this level-->
                    <Filename>?</Filename>
                    <!--Optional:-->
                    <Password>?</Password>
                    <!--Optional:-->
                    <PasswordAlias>?</PasswordAlias>
                </CryptoKey>
                <CryptoSSKey name="?" local="?" intrinsic="?" read-only="?" external="?">
                    <!--Optional:-->
                    <mAdminState>?</mAdminState>
                    <!--You have a CHOICE of the next 1 items at this level-->
                    <Filename>?</Filename>
                </CryptoSSKey>
                <CryptoCertificate name="?" local="?" intrinsic="?" read-only="?" external="?">
                    <!--Optional:-->
                    <mAdminState>?</mAdminState>
                    <!--You have a CHOICE of the next 4 items at this level-->
                    <Filename>?</Filename>
                    <!--Optional:-->
                    <Password>?</Password>
                    <!--Optional:-->
                    <PasswordAlias>?</PasswordAlias>
                    <!--Optional:-->
                    <IgnoreExpiration>?</IgnoreExpiration>
                </CryptoCertificate>
                <CryptoIdentCred name="?" local="?" intrinsic="?" read-only="?" external="?">
                    <!--Optional:-->
                    <mAdminState>?</mAdminState>
                    <!--You have a CHOICE of the next 3 items at this level-->
                    <Key class="?">?</Key>
                    <Certificate class="?">?</Certificate>
                    <!--Zero or more repetitions:-->
                    <CA class="?">?</CA>
                </CryptoIdentCred>
            </man:get-config>
        </man:request>
    </soapenv:Body>
</soapenv:Envelope>
